{
  "url": "https://www.muscatairport.co.om/en/content/baggage",
  "title": "Baggage Services - Muscat International Airport",
  "content": "Baggage Services - Muscat International Airport Corporate Airports Muscat International Airport Salalah Airport Suhar Airport Duqm Airport PDO Airports العربية SUPPORT CALL 0096824351234 Wi-Fi Available Free FLIGHTS Departure Arrival Operating Airlines TO &AMP; FROM AIRPORT Access Road Pick Up and Drop-off Car Parking Taxi Car Rental Shuttle Bus service Security Maraheb SHOP&AMP;DINE Pre-order Service Duty Free Restaurants &amp; Quick Bites AIRPORT EXPERIENCE Airport Facilities & Services Baggage Services Medical Services Tourist Information Desk Travel Agents Business Aviation Visa Deposit Office Lounges Primeclass Lounge Majan Lounge Departure Service Arrival Service Transit Service Fast-track Service Primeclass Porter Service Primeclass Car Wash Service Aerotel Telecom services Public Facilities Banking Services Be Relax Spa . Currency Exchange E-Gate Traveling with Children Free Wi-Fi PDO Greeting Point Passengers with Reduced Mobility MEDIA CENTER × English عربى Wi-Fi Available Free SUPPORT CALL +968 24351234 العربية Passengers Corporate &deg;C FLIGHTS Departure Arrival Operating Airlines TO &amp; FROM AIRPORT Access Road Pick Up and Drop-off Car Parking Taxi Car Rental Shuttle Bus service Security Maraheb SHOP&amp;DINE Pre-order Service Duty Free Restaurants &amp; Quick Bites AIRPORT EXPERIENCE Airport Facilities & Services Baggage Services Medical Services Tourist Information Desk Travel Agents Business Aviation Visa Deposit Office Lounges Primeclass Lounge Majan Lounge Departure Service Arrival Service Transit Service Fast-track Service Primeclass Porter Service Primeclass Car Wash Service Aerotel Telecom services Public Facilities Banking Services Be Relax Spa Currency Exchange E-Gate Traveling with Children Free Wi-Fi PDO Greeting Point Passengers with Reduced Mobility MEDIA CENTER العربية Baggage Services Home Airport experience Airport facilities & services Baggage services Baggage Services Baggage Handling&nbsp; Muscat International Airport has ten reclaim carousels at the arrival&rsquo;s hall, in which eight are International and two Domestics. The Flight Information Display System (FIDS) indicates the flight number and the status of the luggage delivery for all inbound flight.Kindly note that all hold and hand baggage from International or Domestic flights may be subjected to screening by customs prior to leaving the baggage Reclaim area. With the state of art system, Muscat International Airport can accommodate all types of luggage via automated handling at the check-in counters or using the out-of-gauge counters for luggage that do not comply with the allowed dimensions/weight.&nbsp; As per Muscat International Airport standards, baggage must have at least one flat surface therefore departing passengers must ensure that their baggage adheres to the standard, if not, the baggage has to be repacked. Trolley services For hassle-free travel, baggage trolleys are available for charge at convenient locations across Muscat International Airport. On departure, trolleys can be found outside the departures building and in all car parks. For arriving passengers, trolleys can be found in the baggage reclaim area. Porter Services For those who like, porters are available all over Muscat International Airport with prices starting from only 3.5 OR per trolley/porter. The service further facilitates your travel experience by managing any or all of your luggage items within the airport. Our porter service is stationed and available in both departure and arrival areas. Baggage Wrapping Megaton Megaton Cargo Services has a cumulative experience of 34 years in the aviation Industry. Megaton Cargo Kiosk at Muscat International Airport at Departure level operates with a unique idea of converting Passenger&rsquo;s Excess baggage to cargo for those passengers who are unable to pay for higher excess baggage charges to the airlines and is door delivered to their residence. The customer has a choice of availing to different kinds of services according to their budgets such as Express Courier Services, Economical Courier Services and Cargo Services which are based on the urgency of the packages. The deliveries vary simultaneously on the number of transit days that it will occur for receiving the packages at the destination. The customer has different choices to opt for deliveries of their baggage&rsquo;s as follows: - The customer can opt to book the cargo with Megaton Cargo Services prior to their scheduled date of travel, so that it can arrive as soon as they reach their destination. The excess baggage can be brought to our Kiosk near the G check in counter at the departure level 4 of the Muscat International airport and handed over to us prior to their check-in of their baggage at the airline check-in counters. The customer can request for the collection of their cargo from their residence and forward to their destination prior to their scheduled date of travel. Customers who are not travelling but want to send some of their items to their loved ones back home; can also opt to use this service. If the customer is unable to pay the charges of the transportation at the time of handover of their baggage at our counters, they can opt to transfer the payment in our banks account once they reach their destination. We will accept their baggage and store it in our storage area at the airport till they transfer the payment. Once the payment is received in our bank account, we will then dispatch their baggage to residence address. The customer can also opt to deliver the cargo back to their residence locally in Muscat at a minimal cost if they decide not to carry as excess baggage or cargo. The customers have the following modes of transporting their excess baggage&rsquo;s to the final destination through us By Air By Sea By Road&nbsp; Our contact details are as follows:- What&rsquo;s up: 00968-96585377 / 00968-79220113 Email: [email&#160;protected] Office Location G1, Next to Row G check in counters, Departure Level, 4, Muscat International Airport Muscat, Oman &nbsp; Baggage Sealing To ensure the safety of your bags, we advise you to use the baggage sealing from Seal &amp; Go. Sealing protects your bags from theft, damage, drug smuggling, opening, missing and bad weather. Thanks to the innovative sealing technology, &ldquo;shrink sealing&rdquo;, a strong layer of transparent foil is gently heated and shrunk tightly around your baggage in less than a minute. Besides, passengers can benefit from the Seal &amp; Trace service allowing you to trace your lost baggage through registration on the seal and trace portal and via a sticker attached to the exterior of the bag. Once registered online, the luggage is traceable in case of loss. Seal &amp; Go also offers a wide range of safety and travel comfort products such as high-quality locks, stroller covers, backpack covers, and luggage straps available to make your travel as comfortable as possible. With Seal &amp; Go, you no longer have to worry about the safety of your baggage. Seal &amp; Go kiosk is situated in departure area C, next to the visa office. In the coming months, a second kiosk will be available at entrance B. For more information, please visit: www.sealandgo.com &nbsp; AIRPORT EXPERIENCE Airport Facilities & Services Baggage Services Medical Services Tourist Information Desk Travel Agents Business Aviation Visa Deposit Office Lounges Primeclass Lounge Majan Lounge Departure Service Arrival Service Transit Service Fast-track Service Primeclass Porter Service Primeclass Car Wash Service Aerotel Telecom services Public Facilities Banking Services Be Relax Spa Muscat International Airport - Quick Links Contact Airport Virtual Tour FAQ's Access Roads Free Wi-Fi Shopping Transfer Visa & Immigration Lost Properties Feedback Baggage Claim Muscat International Airport is part of Car Rental Car Parking Airport Lounge Trolleys and Porters Baggage Sealing Medical Services Muscat International Airport is part of Oman Airports Salalah Airport Duqm Airport Suhar Airport Muscat International Airport  Signup Enter Email and get notification about new updates, etc. Go © 2022 Muscat International Airport All Rights Reserved.  policy  Policy  &amp;  Follow us: Muscat International Airport - Quick Links Contact Airport Virtual Tour FAQ's Access Roads Free Wi-Fi Shopping Transfer Visa & Immigration Lost Properties Feedback Baggage Claim Car Rental Car Parking Airport Lounge Trolleys and Porters Baggage Sealing Medical Services Muscat International Airport is part of Oman Airports Salalah Airport Duqm Airport Suhar Airport Muscat International Airport © 2022 Muscat International Airport All Rights Reserved.  policy |  Policy |  &amp; ",
  "headings": [
    "SUPPORT CALL",
    "Wi-Fi",
    "Airport Facilities & Services",
    ".",
    "Wi-Fi",
    "SUPPORT CALL",
    "Airport Facilities & Services",
    "Baggage Services",
    "Baggage Services",
    "Baggage Handling&nbsp;",
    "Trolley services",
    "Porter Services",
    "Baggage Wrapping",
    "Megaton",
    "Airport Facilities & Services",
    "Muscat International Airport - Quick Links",
    "Oman Airports",
    "Newsletter Signup",
    "Follow us:",
    "Muscat International Airport - Quick Links",
    "Muscat International Airport is part of",
    "Oman Airports"
  ],
  "scrapedAt": "2025-07-22T13:07:30.580Z"
}